[
    {
        "name": "Supplications for when you wake up",
        "supplications": [
            {
                "ID": 1,
                "ARABIC_TEXT": "(.الْحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ )",
                "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Alhamdu lillahil-lathee ahyana baAAda ma amatana wa-ilayhin-nushoor.)",
                "TRANSLATED_TEXT":"(All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection.)",			
                  "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/1.mp3?alt=media&token=5c2a44ed-38ae-4ee0-9cef-d863af4c8907" 
             },
            {
                "ID": 2,
                "ARABIC_TEXT": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفرْ لِي", 
                  "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(La ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer, subhanal-lah, walhamdu lillah, wala  ilaha illal-lah wallahu akbar, wala hawla wala quwwata illa billahil-AAaliyyil AAatheem. Rabbigh-fir lee)",
                "TRANSLATED_TEXT":"(None has the right to be worshipped except Allah, alone without associate, to Him belongs sovereignty and praise and He is over all things wholly capable.  How perfect Allah is, and all praise is for Allah, and none has the right to be worshipped except Allah, Allah is the greatest and there is no power nor might except with Allah, The Most High, The Supreme.O my Lord forgive me)",
                "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/2.mp3?alt=media&token=677a681a-1314-4ee1-aa60-d62b74910bab" 
             },
            {
                "ID": 3,
                "ARABIC_TEXT": "( الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لي بِذِكْرِهِ )", 
                  "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Alhamdu lillahil-lathee AAafanee fee jasadee waradda AAalayya roohee wa-athina lee bithikrih.)",
                "TRANSLATED_TEXT":"(All praise is for Allah who restored to me my health and returned my soul and  has allowed me to remember Him.)",
                "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/3.mp3?alt=media&token=92a8f3f0-3de7-4c49-a87e-b0c8d7ea4014" 
            },
            {
                "ID": 4,
                "ARABIC_TEXT": "﴿ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لأُوْلِي الألْبَابِ * الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَاماً وَقُعُوداً وَعَلَىَ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ* رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ* رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِياً يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ* رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ* فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لاَ أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَى بَعْضُكُم مِّن بَعْضٍ فَالَّذِينَ هَاجَرُواْ وَأُخْرِجُواْ مِن دِيَارِهِمْ وَأُوذُواْ فِي سَبِيلِي وَقَاتَلُواْ وَقُتِلُواْ لأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ ثَوَاباً مِّن عِندِ اللَّهِ وَاللَّهُ عِندَهُ حُسْنُ الثَّوَابِ * لاَ يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُواْ فِي الْبِلاَدِ * مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ * لَكِنِ الَّذِينَ اتَّقَوْاْ رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا نُزُلاً مِّنْ عِندِ اللَّهِ وَمَا عِندَ اللَّهِ خَيْرٌ لِّلأَبْرَارِ * وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللَّهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَآ أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ لاَ يَشْتَرُونَ بِآيَاتِ اللَّهِ ثَمَناً قَلِيلاً أُوْلَئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ*يَا أَيُّهَا الَّذِينَ آمَنُواْ اصْبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَاتَّقُواْ اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ ﴾" ,
                  "LANGUAGE_ARABIC_TRANSLATED_TEXT":"From Verse 3:190 till the end of the chapter Al-Imran",
                "TRANSLATED_TEXT":"( 190 )   Indeed, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding.( 191 )   Who remember Allah while standing or sitting or [lying] on their sides and give thought to the creation of the heavens and the earth, [saying], Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.( 192 )   Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.( 193 )   Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.( 194 )   Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.( 195 )   And their Lord responded to them, Never will I allow to be lost the work of [any] worker among you, whether male or female; you are of one another. So those who emigrated or were evicted from their homes or were harmed in My cause or fought or were killed - I will surely remove from them their misdeeds, and I will surely admit them to gardens beneath which rivers flow as reward from Allah, and Allah has with Him the best reward.( 196 )   Be not deceived by the [uninhibited] movement of the disbelievers throughout the land.( 197 )   [It is but] a small enjoyment; then their [final] refuge is Hell, and wretched is the resting place.( 198 )   But those who feared their Lord will have gardens beneath which rivers flow, abiding eternally therein, as accommodation from Allah. And that which is with Allah is best for the righteous.( 199 )   And indeed, among the People of the Scripture are those who believe in Allah and what was revealed to you and what was revealed to them, [being] humbly submissive to Allah. They do not exchange the verses of Allah for a small price.Those will have their reward with their Lord. Indeed, Allah is swift in account.( 200 )   O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful.",
                "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/4.mp3?alt=media&token=3ce94237-16a9-462f-8d1c-e25a615a0717" 
             }
        ]
    },
    {
        "name": "Invocation when getting dressed",
        "supplications": [
            {
                "ID": 5,
                "ARABIC_TEXT": "(الْحَمْدُ للَّهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّة...)", 
                  "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Alhamdu lillahil-lathee kasanee hatha (aththawb) warazaqaneehi min ghayri hawlin minnee wala quwwah.)",
                "TRANSLATED_TEXT":"(All Praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself.)",
                "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/5.mp3?alt=media&token=b48a7e22-4890-4a9c-8d48-d0cdb26d5da3" 
             }
        ]
    },
    {
        "name": "Invocation when putting on new clothes",
        "supplications": [
            {
                "ID": 6,
                "ARABIC_TEXT": "( اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ).", 
                  "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Allahumma lakal-hamdu anta kasawtaneeh, as-aluka min khayrihi wakhayri ma suniAAa lah, wa-aAAoothu bika min sharrihi washarri ma suniAAa lah.)",
                "TRANSLATED_TEXT":"(O Allah, for You is all praise, You have clothed me with it (i.e. the garment), I ask You for the good of it and the good for which it was made, and I seek refuge with You from the evil of it and the evil for which it was made.)",
                "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/6.mp3?alt=media&token=5c72f835-2c90-492d-9154-ef6a1b04e66c" 
             }
        ]
    },
    {
        "name": "Invocations for someone who has put on new clothes",
        "supplications": [
            {
                "ID": 7,
                "ARABIC_TEXT": "(تُبْلِي وَيُخْلِفُ اللَّهُ تَعَالَى)",
                  "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Tublee wayukhliful-lahu taAAala.)",
                "TRANSLATED_TEXT":"(May you wear it out and Allah تعالى replace it (with another).’ The intended meaning: A supplication for long life.)",
                "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/7.mp3?alt=media&token=d81d0f60-f132-4418-82cb-1910806ae30b" 
             },
            {
                "ID": 8,
                "ARABIC_TEXT": "(اِلْبَسْ جَدِيداً وَعِشْ حَمِيداً وَمُتْ شَهِيداً).",
                  "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Ilbas jadeedan waAAish hameedan wamut shaheedan.)",
                "TRANSLATED_TEXT":"(Wear anew, live commendably and die a shaheed.)(shaheed:One who dies fighting the kuffar in order to make the word of Allah superior or in defense of Islam.  It also has other meanings found in the Sunnah such as: the one who dies defending his life, wealth or family; the woman who passes away due to childbirth; one who drowns…etc.)",
                "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/8.mp3?alt=media&token=88a934d9-7029-4b4e-b795-88ed50499342" 
             }
        ]
    },
    {
      "name": "What to say when undressing",
      "supplications": [
        {
          "ID": 9,
          "ARABIC_TEXT": "(بِسْمِ اللَّهِ).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Bismil-lah.)",
          "TRANSLATED_TEXT":"(In the name of Allah.)",
          "REPEAT": 1, 
                "AUDIO":"https://firebasestorage.googleapis.com/v0/b/mikrobid-c1e33.appspot.com/o/9.mp3?alt=media&token=5fa8e8a4-7b9a-4818-865d-b1ec6b734068" 
         }
      ]
    },
    {
      "name": "Invocation for entering the restroom",
      "supplications": [
        {
          "ID": 10,
          "ARABIC_TEXT": "([بِسْمِ اللَّهِ] اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"((Bismil-lah) allahumma innee aAAoothu bika minal-khubthi wal-khaba-ith.)", 
             "TRANSLATED_TEXT":"((In the name of Allah).  O Allah, I take refuge with you from all evil and evil-doers.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/10.mp3" 
         }
      ]
    },
    {
      "name": "Invocation for leaving the restroom",
      "supplications": [
        {
          "ID": 11,
          "ARABIC_TEXT": "(غُفْرَانَكَ).",
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Ghufranak.)",
          "TRANSLATED_TEXT":"(I ask You (Allah) for forgiveness.)",
          "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/11.mp3" 
         }
      ]
    },
    {
      "name": "What to say before performing ablution",
      "supplications": [
        {
          "ID": 12,
          "ARABIC_TEXT": "(بِسْمِ اللَّهِ).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Bismil-lah.)", 
             "TRANSLATED_TEXT":"(In the name of Allah.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/12.mp3" 
         }
      ]
    },
    {
      "name": "What to say upon completing ablution",
      "supplications": [
        {
          "ID": 13,
          "ARABIC_TEXT": "(أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ..).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Ashhadu an la ilaha illal-lahu wahdahu la shareeka lah, wa-ashhadu anna Muhammadan AAabduhu warasooluh.)", 
             "TRANSLATED_TEXT":"(I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/13.mp3" 
         },
        {
          "ID": 14,
          "ARABIC_TEXT": "(اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ)", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Allahummaj-AAalnee minat-tawwabeena wajAAalnee minal-mutatahhireen.)", 
             "TRANSLATED_TEXT":"(O Allah, make me of those who return to You often in repentance and make me of those who remain clean and pure.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/14.mp3" 
         },
        {
          "ID": 15,
          "ARABIC_TEXT": "(سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Subhanakal-lahumma wabihamdika ashhadu an la ilaha illa anta astaghfiruka wa-atoobu ilayk.)", 
             "TRANSLATED_TEXT":"(How perfect You are O Allah, and I praise You, I bear witness that none has the right to be worshipped except You, I seek Your forgiveness and turn in repentance to You.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/15.mp3" 
         }
      ]
    },
    {
      "name": "What to say when leaving the home",
      "supplications": [
        {
          "ID": 16,
          "ARABIC_TEXT": "(بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Bismil-lah, tawakkaltu AAalal-lah, wala hawla wala quwwata illa billah.)", 
             "TRANSLATED_TEXT":"(In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/16.mp3" 
         },
        {
          "ID": 17,
          "ARABIC_TEXT": "(اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Allahumma innee aAAoothu bika an adilla aw odal, aw azilla aw ozall, aw athlima aw othlam, aw ajhala aw yujhala AAalay.)", 
             "TRANSLATED_TEXT":"(O Allah, I take refuge with You lest I should stray or be led astray, or slip or be tripped, or oppress or be oppressed, or behave foolishly or be treated foolishly.)(slip: i.e. to commit a sin unintentionally)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/17.mp3" 
         }
      ]
    },
    {
      "name": "What to say when entering the home",
      "supplications": [
        {
          "ID": 18,
          "ARABIC_TEXT": "(بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا، ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Bismil-lahi walajna, wabismil-lahi kharajna, waAAala rabbina tawakkalna.)", 
             "TRANSLATED_TEXT":"(In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/18.mp3" 
         }
      ]
    },
    {
      "name": "Invocation for going to the mosque",
      "supplications": [
        {
          "ID": 19,
          "ARABIC_TEXT": "اللّهُـمَّ اجْعَـلْ فِي قَلْبـي نُوراً ، وَفي لِسَـانِي نُوراً، وَفِي سَمْعِي نُوراً, وَفِي بَصَرِيِ نُوراً, وَمِنْ فََوْقِي نُوراً , وَ مِنْ تَحْتِي نُوراً, وَ عَنْ يَمِينيِ نُوراَ, وعَنْ شِمَالِي نُوراً, وَمْن أَماَمِي نُوراً, وَمِنْ خَلْفيِ نُوراَ, واجْعَلْ فِي نَفْسِي نُوراً, وأَعْظِمْ لِي نُوراً, وَعظِّمْ لِي نُوراً, وَاجْعَلْ لِي نُوراً, واجْعَلنِي نُوراً, أللَّهُمَّ أَعْطِنِي نُوراً, واجْعَلْ فِي عَصَبِي نُوراً, وَفِي لَحْمِي نُوراً, وَفِي دَمِي نُوراً وَفِي شَعْرِي نُوراً, وفِي بَشَرِي نُوراً (أَللَّهُمَّ اجِعَلْ لِي نُوراً فِي قّبْرِي وَ نُوراَ فِي عِظاَمِي) (وَزِدْنِي نُوراً, وَزِدْنِي نُوراَ , وَزِدْنِي نُوراً) (وَهَبْ لِي نُوراً عَلَى نُوراً )", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"Allaahummaj 'al fee qalbee nooran, wa fee lisaanee nooran, wa fee sam'ee nooran, wa fee basaree nooran, wa min fawqee nooran, wa min tahtee nooran, wa 'an yameenee nooran, wa 'an shimaalee nooran, wa min 'amaamee nooran, wa min khalfee nooran. Wa j'al fee nafsee nooran, wa 'a'dhim lee nooran, wa 'a'dhim lee nooran. Waj'al lee nooran, waj'alnee nooran. Allaahumma a'tineje nooran, waj'al fee 'asabee nooran, wa fee lahmee nooran, wa fee damee nooran, wa fee sha'ree nooran, wa fee basharee nooran.[Allaahummaj'al lee nooran fee qabree, wa nooran fee 'idhaamee.][Wa zidnee nooran, wa zidnee nooran, wa zidnee nooran.][Wa hab lee nooran 'alaa noor.]", 
             "TRANSLATED_TEXT":"(‘O Allaah, place within my heart light; and upon my tongue light; and within my ears light; and within my eyes light; and place above me light; and beneath me light; and on my right light; and on my left light; and in front of me light; and behind me light; and place light within my soul; and augment light for me; and greaten light for me; and grant me light and make me light. O Allaah, bestow upon me light; and place light in my tendons; and light in my flesh; and light in my blood; and in light in my hair and light in my skin.’ [O Allaah, place light for me in my grave and light in my bones]. [And increase me with light and increase me with light and increase me with light]. [And grant me light upon light.]’)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/19.mp3" 
         }
      ]
    },
    {
      "name": "Invocation for entering the mosque",
      "supplications": [
        {
          "ID": 20,
          "ARABIC_TEXT": "(يَبْدَأُ بِرِجْلِهِ الْيُمْنَى) ، وَيَقُولُ: ((أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ))  [بِسْمِ اللَّهِ، وَالصَّلَاةُ] [وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ]  ((اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(aAAoothu billahil-AAatheem wabiwajhihil-kareem wasultanihil-qadeem minash-shaytanir-rajeem, [bismil-lah, wassalatu] [wassalamu AAala rasoolil-lah] , allahumma iftah lee abwaba rahmatik.)", 
             "TRANSLATED_TEXT":"(I take refuge with Allah, The Supreme and with His Noble Face, and His eternal authority from the accursed devil. In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, open the gates of Your mercy for me.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/20.mp3" 
         }
      ]
    },
    {
      "name": "Invocation for leaving the mosque",
      "supplications": [
        {
          "ID": 21,
          "ARABIC_TEXT": "((يَبْدَأُ بِرِجْلِهِ الْيُسْرَى))  وَيَقُولُ: ((بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Bismil-lah wassalatu wassalamu AAala rasoolil-lah, allahumma innee as-aluka min fadlik, allahumma iAAsimnee minash-shaytanir-rajeem.)", 
             "TRANSLATED_TEXT":"(In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, I ask You from Your favour.  O Allah, guard me from the accursed devil.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/21.mp3" 
         }
      ]
    },
    {
      "name": "What to say upon hearing the Athan (call to prayer)",
      "supplications": [
        {
          "ID": 22,
          "ARABIC_TEXT": " يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إِلاَّ فِي ((حَيَّ عَلَى الصَّلَاةِ وَحَيَّ عَلَى الْفَلَاحِ)) فَيقُولُ: ((لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"", 
             "TRANSLATED_TEXT":"‘One repeats just as the mu-aththin (one who calls to prayer) says, except when he says: Hayya AAalas-salah (or) hayya AAalal-falah ‘come to prayer, come to success’ instead, one should say: La hawla wala quwwata illa billah. ‘There is no might nor power except with Allah.’", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/22.mp3" 
         },
        {
          "ID": 23,
          "ARABIC_TEXT": " يَقُولُ: ((وَأَنَا أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِاللَّهِ رَبَّاً، وَبِمُحَمَّدٍ رَسُولاً، وَبِالْإِسْلاَمِ دِينَاً)) ((يَقُولُ ذَلِكَ عَقِبَ تَشَهُّدِ الْمُؤَذِّنِ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"Immediately following the declaration of faith called by the mu-aththin, one says:Wa-ana ashhadu an la ilaha illal-lahu wahdahu la shareeka lah, wa-anna Muhammadan AAabduhu warasooluh, radeetu billahi rabban wabimuhammadin rasoolan wabil-islami deena.", 
             "TRANSLATED_TEXT":"Immediately following the declaration of faith called by the mu-aththin, one says:‘And I too bear witness that none has the right to be worshipped except Allah, alone, without partner, and that Muhammad is His salve and Messenger.  I am pleased with Allah as a Lord, and Muhammad as a Messenger and Islam as a religion.’", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/23.mp3" 
         },
        {
          "ID": 24,
          "ARABIC_TEXT": " ((يُصَلِّي عَلَى النَّبِيِّ صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ الْمُؤَذِّنِ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"", 
             "TRANSLATED_TEXT":"‘One should then send prayers on the Prophet (sal-Allaahu 'alayhe wa sallam) after answering the call of the mu.adhdhin’.", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/24.mp3" 
         },
        {
          "ID": 25,
          "ARABIC_TEXT": "يَقُولُ: ((اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامَاً مَحمُوداً الَّذِي وَعَدْتَهُ، [إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ])).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"Allahumma rabba hathihid-daAAwatit-tammah, wassalatil-qa-imah ati Muhammadan alwaseelata wal-fadeelah, wabAAath-hu maqaman mahmoodan allathee waAAadtah, innaka la tukhliful-meeAAad.", 
             "TRANSLATED_TEXT":"‘O Allah, Owner of this perfect call and Owner of this prayer to be performed, bestow upon Muhammad al-waseelah and al-fadeelah and send him upon a praised platform which You have promised him.  Verily, You never fail in Your promise.’al-waseelah: A station in paradise.al-fadeelah: A rank above the rest of creation.praised platform: One in which all of creation will praise him on, in order to bring about the account quickly and be relieved from the lengthy standing or the role of intercession.", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/25.mp3" 
         },
        {
          "ID": 26,
          "ARABIC_TEXT": "((يَدْعُو لِنَفسِهِ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَإِنَّ الدُّعَاءَ حِينَئِذٍ لاَ يُرَدُّ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"", 
             "TRANSLATED_TEXT":"One should also supplicate for himself during the time between the athan and the iqamah as supplication at such time is not rejected.", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/26.mp3" 
         }
      ]
    },
    {
      "name": "Invocations for the beginning of the prayer",
      "supplications": [
        {
          "ID": 27,
          "ARABIC_TEXT": " ((اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْني مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْماءِ وَالْبَرَدِ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Allahumma baAAid baynee wabayna khatayaya kama baAAadta baynal-mashriqi walmaghrib, allahumma naqqinee min khatayaya kama yunaqqath-thawbul-abyadu minad-danas, allahummagh-silnee min khatayaya biththalji walma/i walbarad.)", 
             "TRANSLATED_TEXT":"(O Allah, distance me from my sins just as You have distanced The East from The West, O Allah, purify me of my sins as a white robe is purified of filth, O Allah, cleanse me of my sins with snow, water, and ice.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/27.mp3" 
         },
        {
          "ID": 28,
          "ARABIC_TEXT": "((سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Subhanakal-lahumma wabihamdika watabarakas-muka wataAAala jadduka wala ilaha ghayruk.)", 
             "TRANSLATED_TEXT":"(How perfect You are O Allah, and I praise You.  Blessed be Your name, and lofty is Your position and none has the right to be worshipped except You.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/28.mp3" 
         },
        {
          "ID": 29,
          "ARABIC_TEXT": "((وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفَاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاَتِي، وَنُسُكِي، وَمَحْيَايَ، وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ المَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبي جَمِيعَاً إِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ. وَاهْدِنِي لِأَحْسَنِ الأَخْلاقِ لاَ يَهْدِي لِأَحْسَنِها إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالخَيْرُ كُلُّهُ بِيَـــــــدَيْكَ، وَالشَّـــــرُّ لَيْسَ إِلَيْــــــكَ، أَنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Wajjahtu wajhiya lillathee fataras-samawati wal-arda haneefan wama ana minal-mushrikeen, inna salatee wanusukee wamahyaya wamamatee lillahi rabbil-AAalameen, la shareeka lahu wabithalika omirtu wa-ana minal-muslimeen. Allahumma antal-maliku la ilaha illa ant. anta rabbee wa-ana AAabduk, thalamtu nafsee waAAtaraftu bithanbee faghfir lee thunoobee jameeAAan innahu la yaghfiruth-thunooba illa ant.wahdinee li-ahsanil-akhlaqi la yahdee li-ahsaniha illa ant, wasrif AAannee sayyi-aha la yasrifu AAannee sayyi-aha illa ant, labbayka wasaAAdayk,walkhayru kulluhu biyadayk, washsharru laysa ilayk, ana bika wa-ilayk, tabarakta wataAAalayt, astaghfiruka wa-atoobu ilayk.)", 
             "TRANSLATED_TEXT":"(I have turned my face sincerely towards He who has brought forth the heavens and the Earth and I am not of those who associate (others with Allah).  Indeed my prayer, my sacrifice, my life and my death are for Allah, Lord of the worlds, no partner has He, with this I am commanded and I am of the Muslims. O Allah, You are the Sovereign, none has the right to be worshipped except You.  You are my Lord and I am Your servant, I have wronged my own soul and have acknowledged my sin, so forgive me all my sins for no one forgives sins except You.  Guide me to the best of characters for none can guide to it other than You, and deliver me from the worst of characters for none can deliver me from it other than You.  Here I am, in answer to Your call, happy to serve you.  All good is within Your hands and evil does not stem from You.  I exist by your will and will return to you.  Blessed and High are You, I seek Your forgiveness and repent unto You.)(Allah does not create pure evil which does not have any good or contain any benefit, wisdom or mercy at all, nor does He punish anyone without having commited a sin. Something can be good in terms of its creation when viewed in a particular  perspective and at the same time be evil when viewed in another way. Allah created the devil and by him, He tests His servants, so there are those who hate the devil, fight him and his way and they stand at enmity towards him and his followers and there are others who are at allegiance with the devil and follow his steps. So evil exists in His creatures by His will and wisdom, not in His actions or act of creating.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/29.mp3" 
         },
        {
          "ID": 30,
          "ARABIC_TEXT": "((اللَّهُمَّ رَبَّ جِبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيلَ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ. اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقيمٍ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Allahumma rabba jibra-eel, wameeka-eel, wa-israfeel fatiras-samawati walard, AAalimal-ghaybi washshahadah, anta tahkumu bayna AAibadika feema kanoo feehi yakhtalifoon. ihdinee limakh-tulifa feehi minal-haqqi bi-ithnik, innaka tahdee man tasha-o ila siratin mustaqeem.)", 
             "TRANSLATED_TEXT":"(O Allah, Lord of Jibra-eel, Meeka-eel and Israfeel (great angles), Creator of the heavens and the Earth, Knower of the seen and the unseen.  You are the arbitrator  between Your servants in that which they have disputed.  Guide me to the truth by Your leave, in that which they have differed, for verily You guide whom You will to a straight path.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/30.mp3" 
         },
        {
          "ID": 31,
          "ARABIC_TEXT": "((اللَّهُ أَكْبَرُ كَبِيرَاً، اللَّهُ أَكْبَرُ كَبِيراً، اللَّهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً)) ثَلاثاً ((أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ)).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Allahu akbaru kabeera, Allahu akbaru kabeera, Allahu akbaru kabeera, walhamdu lillahi katheera, walhamdu lillahi katheera, walhamdu lillahi katheera, wasubhanal-lahi bukratan wa-aseela.)(aAAoothu billahi minash-shaytani min nafkhihi wanafthihi wahamzih.)", 
             "TRANSLATED_TEXT":"(Allah is Most Great, Allah is Most Great, Allah is Most Great, much praise is for Allah, much praise is for Allah, much praise is for Allah, and I declare the perfection of Allah in the early morning and in the late afternoon.)(I take refuge with Allah from the devil, from his pride, his poetry and his madness.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/31.mp3" 
         },
        {
          "ID": 32,
          "ARABIC_TEXT": "((اللَّهُمَّ لَكَ الْحَمْدُ، أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، [وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَواتِ وَالأَرْضِ وَمَنْ فِيهِنَّ] [وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ] [وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَوَاتِ وَالأَرْضِ] [وَلَكَ الْحَمْدُ] [أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقاؤُكَ الْحَقُّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمحَمَّدٌ صلى الله عليه وسلم حَقٌّ، وَالسّاعَةُ حَقٌّ] [اللَّهُمَّ لَكَ أَسْلَمتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خاصَمْتُ، وَإِلَيْكَ حاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ] [وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي] [أَنْتَ المُقَدِّمُ، وَأَنْتَ المُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ] [أَنْتَ إِلَهِي لاَ إِلَهَ إِلاَّ أَنْتَ] [وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ])).", 
              "LANGUAGE_ARABIC_TRANSLATED_TEXT":"(Allahumma lakal-hamd anta noorus-samawati wal-ardi waman feehin, walakal-hamd, anta qayyimus-samawati walardi waman feehin, [walakal-hamd, anta rabbus-samawati walardi waman feehin], [walakal-hamd, laka mulkus-samawati walardi waman feehin] [walakal-hamd, anta malikus-samawati walard] [walakal-hamd] [antal-haq, wawaAAdukal-haq, waqawlukal-haq, waliqa-okal-haq, waljannatu haq wannaru haq, wannabiyyoona haq, wa Muhammadun  haq, wassaAAatu haq] [allahumma laka aslamt, waAAalayka tawakkalt, wabika amant, wa-ilayka anabt, wabika khasamt, wa-ilayka hakamt, faghfir lee ma qaddamt, wama akhkhart, wama asrart, wama aAAlant] [antal-muqaddim, wa-antal-mu-akhkhir, la ilaha illa ant] [anta ilahee la ilaha illa ant .)", 
             "TRANSLATED_TEXT":"(O Allah, to You belongs all praise, You are the Light of the heavens and the Earth and all that is within them.  To You belongs all praise, You are the Sustainer of the heavens and the Earth and all that is within them.  To You belongs all praise.  You are Lord of the heavens and the Earth and all that is within them.  To You belongs all praise and the kingdom of the heavens and the Earth and all that is within them.  To You belongs all praise, You are the King of the heavens and the Earth and to You belongs all praise. You are The Truth, Your promise is true, your Word is true, and the Day in which we will encounter You is true, the Garden of Paradise is true and the Fire is true, and the Prophets are true, Muhammad  is true and the Final Hour is true.  O Allah, unto You I have submitted, and upon You I have relied, and in You I have believed, and to You I have turned in repentance, and over You I have disputed, and to You I have turned for judgment.  So forgive me for what has come to pass of my sins and what will come to pass, and what I have hidden and what I have made public.  You are Al-Muqaddim and Al-Mu-akhkhir. None has the right to be worshipped except You, You are my Deity, none has the right to be worshipped except You.)(Meaning of Al-Muqaddim and Al-Mu-akhkhir: Allah puts forward and favours whom He wills from amongst His creation just as He defers and holds back whom He wills in accordance to His wisdom.  E.g. Favouring man over the rest of creation, favouring the Prophets over the rest of mankind, favouring Muhammad  over all the Prophets and Messengers…etc.)", 
             "REPEAT": 1, 
                "AUDIO":"http://www.hisnmuslim.com/audio/ar/32.mp3" 
         }
      ]
    }
]
